app/controllers/calendar_controller.rb

      #  end
      #end
      EventDB.Delelte(the_event.eventid)
      session[:current_event].delete_if {|ee| ee.eventid==the_event.eventid.to_i}
---
DELETE FROM `event_dbs` WHERE `event_dbs`.`id` = 12466